       IDENTIFICATION DIVISION.
       PROGRAM-ID. EJERCICIO-DIVISIONES.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.

       PROCEDURE DIVISION.
       PROCESO.
           DISPLAY “Hello World” 
           STOP RUN.